Revit 2027 API
UIDocument.GetPlacementTypes Method
 Get a collection of valid placement types for input family symbol.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FaceBasedPlacementType> GetPlacementTypes(
	FamilySymbol familySymbol,
	View pDBView
)
Public Function GetPlacementTypes (
	familySymbol As FamilySymbol,
	pDBView As View
) As IList(Of FaceBasedPlacementType)
public:
IList<FaceBasedPlacementType>^ GetPlacementTypes(
	FamilySymbol^ familySymbol,
	View^ pDBView
)
member GetPlacementTypes :
        familySymbol : FamilySymbol *
        pDBView : View -> IList<FaceBasedPlacementType>
Parameters
familySymbol FamilySymbol
 The family symbol.
pDBView View
 The view in which the family instance will be placed in.
Return Value
IList<FaceBasedPlacementType>
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace